{
    "api": "transformers.ClapFeatureExtractor",
    "type": "class",
    "version": "main",
    "args_list": [
        "feature_size",
        "sampling_rate",
        "hop_length",
        "max_length_s",
        "fft_window_size",
        "padding_value",
        "return_attention_mask",
        "frequency_min",
        "frequency_max",
        "top_db",
        "truncation",
        "padding",
        "**kwargs"
    ],
    "params": [
        {
            "name": "feature_size",
            "type": "int",
            "optional": true,
            "default": "64",
            "description": "The feature dimension of the extracted Mel spectrograms. This corresponds to the number of mel filters(n_mels)."
        },
        {
            "name": "sampling_rate",
            "type": "int",
            "optional": true,
            "default": "48000",
            "description": "The sampling rate at which the audio files should be digitalized expressed in hertz (Hz). This only servesto warn users if the audio fed to the feature extractor does not have the same sampling rate."
        },
        {
            "name": "hop_length",
            "type": "int,optional, defaults to 480",
            "optional": true,
            "default": "480",
            "description": "Length of the overlaping windows for the STFT used to obtain the Mel Spectrogram. The audio will be splitin smaller frames with a step of hop_length between each frame."
        },
        {
            "name": "max_length_s",
            "type": "int",
            "optional": true,
            "default": "10",
            "description": "The maximum input length of the model in seconds. This is used to pad the audio."
        },
        {
            "name": "fft_window_size",
            "type": "int",
            "optional": true,
            "default": "1024",
            "description": "Size of the window (in samples) on which the Fourier transform is applied. This controls the frequencyresolution of the spectrogram. 400 means that the fourrier transform is computed on windows of 400 samples."
        },
        {
            "name": "padding_value",
            "type": "float",
            "optional": true,
            "default": "0.0",
            "description": "Padding value used to pad the audio. Should correspond to silences."
        },
        {
            "name": "return_attention_mask",
            "type": "bool",
            "optional": true,
            "default": "False",
            "description": "Whether or not the model should return the attention masks coresponding to the input."
        },
        {
            "name": "frequency_min",
            "type": "float",
            "optional": true,
            "default": "",
            "description": "The lowest frequency of interest. The STFT will not be computed for values below this."
        },
        {
            "name": "frequency_max",
            "type": "float",
            "optional": true,
            "default": "",
            "description": "The highest frequency of interest. The STFT will not be computed for values above this."
        },
        {
            "name": "top_db",
            "type": "float",
            "optional": true,
            "default": "",
            "description": "The highest decibel value used to convert the mel spectrogram to the log scale. For more details see theaudio_utils.power_to_db function"
        },
        {
            "name": "truncation",
            "type": "str",
            "optional": true,
            "default": "",
            "description": "Truncation pattern for long audio inputs. Two patterns are available:fusion will use _random_mel_fusion, which stacks 3 random crops from the mel spectrogram and adownsampled version of the entire mel spectrogram.If config.fusion is set to True, shorter audios also need to to return 4 mels, which will just be a copyof the original mel obtained from the padded audio.rand_trunc will select a random crop of the mel spectrogram."
        },
        {
            "name": "padding",
            "type": "str",
            "optional": true,
            "default": "",
            "description": "Padding pattern for shorter audio inputs. Three patterns were originally implemented:repeatpad: the audio is repeated, and then padded to fit the max_length.repeat: the audio is repeated and then cut to fit the max_lengthpad: the audio is padded."
        }
    ],
    "return": ""
}