{
    "api": "transformers.AlbertTokenizerFast",
    "type": "class",
    "version": "main",
    "args_list": [
        "vocab_file",
        "tokenizer_file",
        "do_lower_case",
        "remove_space",
        "keep_accents",
        "bos_token",
        "eos_token",
        "unk_token",
        "sep_token",
        "pad_token",
        "cls_token",
        "mask_token",
        "**kwargs"
    ],
    "params": [
        {
            "name": "vocab_file",
            "type": "str",
            "optional": false,
            "default": "None",
            "description": "SentencePiece file (generally has a .spm extension) thatcontains the vocabulary necessary to instantiate a tokenizer."
        },
        {
            "name": "do_lower_case",
            "type": "bool",
            "optional": true,
            "default": "True",
            "description": "Whether or not to lowercase the input when tokenizing."
        },
        {
            "name": "remove_space",
            "type": "bool",
            "optional": true,
            "default": "True",
            "description": "Whether or not to strip the text when tokenizing (removing excess spaces before and after the string)."
        },
        {
            "name": "keep_accents",
            "type": "bool",
            "optional": true,
            "default": "False",
            "description": "Whether or not to keep accents when tokenizing."
        },
        {
            "name": "bos_token",
            "type": "str",
            "optional": true,
            "default": "[CLS]",
            "description": "The beginning of sequence token that was used during pretraining. Can be used a sequence classifier token.When building a sequence using special tokens, this is not the token that is used for the beginning ofsequence. The token used is the cls_token."
        },
        {
            "name": "eos_token",
            "type": "str",
            "optional": true,
            "default": "[SEP]",
            "description": "The end of sequence token. .. note:: When building a sequence using special tokens, this is not the tokenthat is used for the end of sequence. The token used is the sep_token."
        },
        {
            "name": "unk_token",
            "type": "str",
            "optional": true,
            "default": "<unk>",
            "description": "The unknown token. A token that is not in the vocabulary cannot be converted to an ID and is set to be thistoken instead."
        },
        {
            "name": "sep_token",
            "type": "str",
            "optional": true,
            "default": "[SEP]",
            "description": "The separator token, which is used when building a sequence from multiple sequences, e.g. two sequences forsequence classification or for a text and a question for question answering. It is also used as the lasttoken of a sequence built with special tokens."
        },
        {
            "name": "pad_token",
            "type": "str",
            "optional": true,
            "default": "<pad>",
            "description": "The token used for padding, for example when batching sequences of different lengths."
        },
        {
            "name": "cls_token",
            "type": "str",
            "optional": true,
            "default": "[CLS]",
            "description": "The classifier token which is used when doing sequence classification (classification of the whole sequenceinstead of per-token classification). It is the first token of the sequence when built with special tokens."
        },
        {
            "name": "mask_token",
            "type": "str",
            "optional": true,
            "default": "[MASK]",
            "description": "The token used for masking values. This is the token used when training this model with masked languagemodeling. This is the token which the model will try to predict."
        }
    ],
    "return": ""
}