{
    "api": "transformers.TableQuestionAnsweringPipeline.__call__",
    "type": "function",
    "version": "main",
    "args_list": [
        "*args",
        "**kwargs",
        ")"
    ],
    "params": [
        {
            "name": "table",
            "type": "pd.DataFrame,Dict",
            "optional": false,
            "default": "",
            "description": "Pandas DataFrame or dictionary that will be converted to a DataFrame containing all the table values.See above for an example of dictionary."
        },
        {
            "name": "query",
            "type": "str,List[str]",
            "optional": false,
            "default": "",
            "description": "Query or list of queries that will be sent to the model alongside the table."
        },
        {
            "name": "sequential",
            "type": "bool",
            "optional": true,
            "default": "",
            "description": "Whether to do inference sequentially or as a batch. Batching is faster, but models like SQA require theinference to be done sequentially to extract relations within sequences, given their conversationalnature."
        },
        {
            "name": "padding",
            "type": "bool, str,PaddingStrategy",
            "optional": true,
            "default": "",
            "description": "Activates and controls padding. Accepts the following values:True or longest: Pad to the longest sequence in the batch (or no padding if only a singlesequence if provided).max_length: Pad to a maximum length specified with the argument max_length or to the maximumacceptable input length for the model if that argument is not provided.False or do_not_pad (default): No padding (i.e., can output a batch with sequences of differentlengths)."
        },
        {
            "name": "truncation",
            "type": "bool, str,TapasTruncationStrategy",
            "optional": true,
            "default": "",
            "description": "Activates and controls truncation. Accepts the following values:True or drop_rows_to_fit: Truncate to a maximum length specified with the argument max_lengthor to the maximum acceptable input length for the model if that argument is not provided. This willtruncate row by row, removing rows from the table.False or do_not_truncate (default): No truncation (i.e., can output batch with sequence lengthsgreater than the model maximum admissible input size)."
        }
    ],
    "return": "A dictionary or a list of dictionaries containing results"
}