{
    "api": "transformers.ImageClassificationPipeline.__call__",
    "type": "function",
    "version": "main",
    "args_list": [
        "inputs:",
        "typing.Union[str,",
        "typing.List[str],",
        "ForwardRef('Image.Image'),",
        "typing.List[ForwardRef('Image.Image')]]",
        "**kwargs"
    ],
    "params": [
        {
            "name": "inputs",
            "type": "str, List[str], PIL.Image,List[PIL.Image]",
            "optional": false,
            "default": "",
            "description": "The pipeline handles three types of images:A string containing a http link pointing to an imageA string containing a local path to an imageAn image loaded in PIL directlyThe pipeline accepts either a single image or a batch of images, which must then be passed as a string.Images in a batch must all be in the same format: all as http links, all as local paths, or all as PILimages."
        },
        {
            "name": "function_to_apply",
            "type": "str",
            "optional": true,
            "default": "",
            "description": "The function to apply to the model outputs in order to retrieve the scores. Accepts four differentvalues:If this argument is not specified, then it will apply the following functions according to the numberof labels:If the model has a single label, will apply the sigmoid function on the output.If the model has several labels, will apply the softmax function on the output.Possible values are:sigmoid: Applies the sigmoid function on the output.softmax: Applies the softmax function on the output.none: Does not apply any function on the output."
        },
        {
            "name": "top_k",
            "type": "int",
            "optional": true,
            "default": "",
            "description": "The number of top labels that will be returned by the pipeline. If the provided number is higher thanthe number of labels available in the model configuration, it will default to the number of labels."
        },
        {
            "name": "timeout",
            "type": "float",
            "optional": true,
            "default": "",
            "description": "The maximum time in seconds to wait for fetching images from the web. If None, no timeout is set andthe call may block forever."
        }
    ],
    "return": ""
}