{
    "api": "transformers.DebertaV2Tokenizer",
    "type": "class",
    "version": "main",
    "args_list": [
        "vocab_file",
        "do_lower_case",
        "split_by_punct",
        "bos_token",
        "eos_token",
        "unk_token",
        "sep_token",
        "pad_token",
        "cls_token",
        "mask_token",
        "sp_model_kwargs",
        "typing.Any]]",
        "**kwargs"
    ],
    "params": [
        {
            "name": "vocab_file",
            "type": "str",
            "optional": false,
            "default": "",
            "description": "SentencePiece file (generally has a .spm extension) thatcontains the vocabulary necessary to instantiate a tokenizer."
        },
        {
            "name": "do_lower_case",
            "type": "bool",
            "optional": true,
            "default": "False",
            "description": "Whether or not to lowercase the input when tokenizing."
        },
        {
            "name": "bos_token",
            "type": "string",
            "optional": true,
            "default": "[CLS]",
            "description": "The beginning of sequence token that was used during pre-training. Can be used a sequence classifier token.When building a sequence using special tokens, this is not the token that is used for the beginning ofsequence. The token used is the cls_token."
        },
        {
            "name": "eos_token",
            "type": "string",
            "optional": true,
            "default": "[SEP]",
            "description": "The end of sequence token. When building a sequence using special tokens, this is not the token that isused for the end of sequence. The token used is the sep_token."
        },
        {
            "name": "unk_token",
            "type": "str",
            "optional": true,
            "default": "[UNK]",
            "description": "The unknown token. A token that is not in the vocabulary cannot be converted to an ID and is set to be thistoken instead."
        },
        {
            "name": "sep_token",
            "type": "str",
            "optional": true,
            "default": "[SEP]",
            "description": "The separator token, which is used when building a sequence from multiple sequences, e.g. two sequences forsequence classification or for a text and a question for question answering. It is also used as the lasttoken of a sequence built with special tokens."
        },
        {
            "name": "pad_token",
            "type": "str",
            "optional": true,
            "default": "[PAD]",
            "description": "The token used for padding, for example when batching sequences of different lengths."
        },
        {
            "name": "cls_token",
            "type": "str",
            "optional": true,
            "default": "[CLS]",
            "description": "The classifier token which is used when doing sequence classification (classification of the whole sequenceinstead of per-token classification). It is the first token of the sequence when built with special tokens."
        },
        {
            "name": "mask_token",
            "type": "str",
            "optional": true,
            "default": "[MASK]",
            "description": "The token used for masking values. This is the token used when training this model with masked languagemodeling. This is the token which the model will try to predict."
        },
        {
            "name": "sp_model_kwargs",
            "type": "dict",
            "optional": true,
            "default": "",
            "description": "Will be passed to the SentencePieceProcessor.__init__() method. The Python wrapper forSentencePiece can be used, among other things,to set:enable_sampling: Enable subword regularization.nbest_size: Sampling parameters for unigram. Invalid for BPE-Dropout.nbest_size = {0,1}: No sampling is performed.nbest_size > 1: samples from the nbest_size results.nbest_size < 0: assuming that nbest_size is infinite and samples from the all hypothesis (lattice)using forward-filtering-and-backward-sampling algorithm.alpha: Smoothing parameter for unigram sampling, and dropout probability of merge operations forBPE-dropout."
        }
    ],
    "return": ""
}