{
    "api": "transformers.Wav2Vec2ForCTC.load_adapter",
    "type": "function",
    "version": "main",
    "args_list": [
        "target_lang:",
        "str",
        "force_load",
        "**kwargs"
    ],
    "params": [
        {
            "name": "target_lang",
            "type": "str",
            "optional": false,
            "default": "",
            "description": "Has to be a language id of an existing adapter weight. Adapter weights are stored in the formatadapter..safetensors or adapter..bin"
        },
        {
            "name": "force_load",
            "type": "bool, defaults to True",
            "optional": false,
            "default": "True",
            "description": "Whether the weights shall be loaded even if target_lang matches self.target_lang."
        },
        {
            "name": "cache_dir",
            "type": "Union[str, os.PathLike]",
            "optional": true,
            "default": "",
            "description": "Path to a directory in which a downloaded pretrained model configuration should be cached if thestandard cache should not be used."
        },
        {
            "name": "force_download",
            "type": "bool",
            "optional": true,
            "default": "",
            "description": "Whether or not to force the (re-)download of the model weights and configuration files, overriding thecached versions if they exist."
        },
        {
            "name": "resume_download",
            "type": "",
            "optional": false,
            "default": "",
            "description": "Deprecated and ignored. All downloads are now resumed by default when possible.Will be removed in v5 of Transformers."
        },
        {
            "name": "proxies",
            "type": "Dict[str, str]",
            "optional": true,
            "default": "",
            "description": "A dictionary of proxy servers to use by protocol or endpoint, e.g., {http: foo.bar:3128, http://hostname: foo.bar:4012}. The proxies are used on each request."
        },
        {
            "name": "local_files_only(bool,",
            "type": "optional, defaults to False",
            "optional": true,
            "default": "",
            "description": "Whether or not to only look at local files (i.e., do not try to download the model)."
        },
        {
            "name": "token",
            "type": "str,bool",
            "optional": true,
            "default": "",
            "description": "The token to use as HTTP bearer authorization for remote files. If True, or not specified, will usethe token generated when running huggingface-cli login (stored in ~/.huggingface)."
        },
        {
            "name": "revision",
            "type": "str",
            "optional": true,
            "default": "",
            "description": "The specific model version to use. It can be a branch name, a tag name, or a commit id, since we use agit-based system for storing models and other artifacts on huggingface.co, so revision can be anyidentifier allowed by git.To test a pull request you made on the Hub, you can pass revision=refs/pr/<pr_number>."
        },
        {
            "name": "mirror",
            "type": "str",
            "optional": true,
            "default": "",
            "description": "Mirror source to accelerate downloads in China. If you are from China and have an accessibilityproblem, you can set this option to resolve it. Note that we do not guarantee the timeliness or safety.Please refer to the mirror site for more information."
        }
    ],
    "return": ""
}